learning_git.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-02-09 Thu 22:27 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Practice on Git and Github</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Zheng Tian" />
<link rel="stylesheet" type="text/css" href="css/readtheorg.css" />
</head>
<body>
<div id="content">
<h1 class="title">Practice on Git and Github</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orge31cf7a">1. Introduction</a></li>
<li><a href="#org6c37406">2. Git Basics</a>
<ul>
<li><a href="#org33fccdf">2.1. Git configuration</a></li>
<li><a href="#org0884583">2.2. Get help</a></li>
<li><a href="#orgd5db534">2.3. Create a git repository</a></li>
<li><a href="#orgbff22c5">2.4. Check status</a></li>
<li><a href="#org1761f3e">2.5. Stage files and changes</a></li>
<li><a href="#org0088b34">2.6. Commit</a></li>
<li><a href="#org5f84764">2.7. Remove files</a></li>
<li><a href="#org7073db7">2.8. Move and rename file</a></li>
<li><a href="#orgd5df10a">2.9. View commit history</a></li>
<li><a href="#org225eee3">2.10. Undoing things</a></li>
<li><a href="#orgfa0e943">2.11. Unstaging a staged file</a></li>
<li><a href="#org6c32087">2.12. Unmodifying a modified file</a></li>
<li><a href="#orgef0f0b2">2.13. Working with remote</a></li>
</ul>
</li>
<li><a href="#orgf324784">3. Git Branching</a>
<ul>
<li><a href="#org5b30160">3.1. Create and switch branch</a></li>
<li><a href="#orga968f93">3.2. Merge</a></li>
<li><a href="#orga47b4e7">3.3. Merge conflicts</a></li>
<li><a href="#orge4720b7">3.4. Branch management</a></li>
<li><a href="#org7d8ec60">3.5. Remote branch</a></li>
<li><a href="#orgc649e10">3.6. Pushing</a></li>
<li><a href="#orgc4d6836">3.7. Tracking branch</a></li>
<li><a href="#org04fc766">3.8. Pulling</a></li>
<li><a href="#org3971b02">3.9. Delete remote branches</a></li>
<li><a href="#org65be637">3.10. Rebasing</a>
<ul>
<li><a href="#org1239fd1">Basic rebase</a></li>
<li><a href="#org181a23d">The perils of rebasing</a></li>
<li><a href="#orgef050be">Rebase vs. Merge</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org411c81f">4. <span class="todo TODO">TODO</span> Git server</a></li>
<li><a href="#orgdf08e0b">5. <span class="todo TODO">TODO</span> Distributed Git</a></li>
<li><a href="#orgeff304b">6. <span class="todo TODO">TODO</span> Github</a></li>
<li><a href="#org710fc2b">7. <span class="todo TODO">TODO</span> Git tools</a>
<ul>
<li><a href="#orgc4f92a7">7.1. <span class="todo TODO">TODO</span> Stashing and cleaning</a></li>
<li><a href="#org20cc2e9">7.2. <span class="todo TODO">TODO</span> Reset demystified</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-orge31cf7a" class="outline-2">
<h2 id="orge31cf7a"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
This file is for practicing using git and github with a mock project,
"gittest". I'll follow chapters in <i>Pro Git</i>.
</p>
</div>
</div>


<div id="outline-container-org6c37406" class="outline-2">
<h2 id="org6c37406"><span class="section-number-2">2</span> Git Basics</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-org33fccdf" class="outline-3">
<h3 id="org33fccdf"><span class="section-number-3">2.1</span> Git configuration</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>Use <code>git config --list</code></li>
<li><code>git config --global user.name "Zheng Tian"</code></li>
<li><code>git config --global user.email "zt@example.com"</code></li>
</ul>
</div>
</div>

<div id="outline-container-org0884583" class="outline-3">
<h3 id="org0884583"><span class="section-number-3">2.2</span> Get help</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li><code>git help &lt;verb&gt;</code> or <code>git &lt;verb&gt; --help</code></li>
</ul>
</div>
</div>

<div id="outline-container-orgd5db534" class="outline-3">
<h3 id="orgd5db534"><span class="section-number-3">2.3</span> Create a git repository</h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li>Use <code>git init</code></li>
<li>Use <code>git clone URL &lt;name&gt;</code></li>
</ul>
</div>
</div>

<div id="outline-container-orgbff22c5" class="outline-3">
<h3 id="orgbff22c5"><span class="section-number-3">2.4</span> Check status</h3>
<div class="outline-text-3" id="text-2-4">
<ul class="org-ul">
<li><code>git status</code></li>
<li><code>git diff</code></li>
<li><code>git diff --staged</code></li>
</ul>
</div>
</div>

<div id="outline-container-org1761f3e" class="outline-3">
<h3 id="org1761f3e"><span class="section-number-3">2.5</span> Stage files and changes</h3>
<div class="outline-text-3" id="text-2-5">
<ul class="org-ul">
<li><code>git add &lt;filename&gt;</code></li>
<li><code>git add -A</code></li>
<li><code>git add .</code></li>
</ul>
</div>
</div>

<div id="outline-container-org0088b34" class="outline-3">
<h3 id="org0088b34"><span class="section-number-3">2.6</span> Commit</h3>
<div class="outline-text-3" id="text-2-6">
<ul class="org-ul">
<li><code>git commit -m "message"</code></li>
<li><code>git commit -a -m "message"</code>: skip the staging area</li>
</ul>
</div>
</div>

<div id="outline-container-org5f84764" class="outline-3">
<h3 id="org5f84764"><span class="section-number-3">2.7</span> Remove files</h3>
<div class="outline-text-3" id="text-2-7">
<ul class="org-ul">
<li><code>git rm filename</code>: remove the file from both working directory and
staging area.</li>
<li><code>git rm --cached file</code>: remove the file only from the staging area
not in working directory.</li>
</ul>
</div>
</div>

<div id="outline-container-org7073db7" class="outline-3">
<h3 id="org7073db7"><span class="section-number-3">2.8</span> Move and rename file</h3>
<div class="outline-text-3" id="text-2-8">
<ul class="org-ul">
<li><code>git mv file_from file_to</code>: file<sub>from</sub> must have been staged.</li>
</ul>
</div>
</div>

<div id="outline-container-orgd5df10a" class="outline-3">
<h3 id="orgd5df10a"><span class="section-number-3">2.9</span> View commit history</h3>
<div class="outline-text-3" id="text-2-9">
<ul class="org-ul">
<li><code>git log</code></li>
<li><code>git log -p -2</code>: show the difference (-p) of the last two commits</li>
<li><code>git log --pretty=format:"%h %s" --graph</code>: show commit history in a
pretty format with a tree-like graph.</li>
<li><code>git log --since="2008-01-15"</code></li>
</ul>
</div>
</div>

<div id="outline-container-org225eee3" class="outline-3">
<h3 id="org225eee3"><span class="section-number-3">2.10</span> Undoing things</h3>
<div class="outline-text-3" id="text-2-10">
<ul class="org-ul">
<li><code>git commit --amend</code></li>
</ul>
</div>
</div>

<div id="outline-container-orgfa0e943" class="outline-3">
<h3 id="orgfa0e943"><span class="section-number-3">2.11</span> Unstaging a staged file</h3>
<div class="outline-text-3" id="text-2-11">
<ul class="org-ul">
<li><code>git reset HEAD file</code></li>
</ul>
</div>
</div>

<div id="outline-container-org6c32087" class="outline-3">
<h3 id="org6c32087"><span class="section-number-3">2.12</span> Unmodifying a modified file</h3>
<div class="outline-text-3" id="text-2-12">
<ul class="org-ul">
<li><code>git checkout -- file</code>.</li>
</ul>
</div>
</div>

<div id="outline-container-orgef0f0b2" class="outline-3">
<h3 id="orgef0f0b2"><span class="section-number-3">2.13</span> Working with remote</h3>
<div class="outline-text-3" id="text-2-13">
<ul class="org-ul">
<li><code>git remote -v</code> show all remote repository with URL</li>
<li><code>git remote add [remote-name] URL</code> add a remote with a short name <code>pb</code>.</li>
<li><code>git fetch [remote-name]</code> only download data not merge.</li>
<li><code>git pull</code> fetch and merge</li>
<li><code>git push [remote-name] [branch-name]</code></li>
<li><code>git remote show [remote-name]</code></li>
<li><code>git remote rename [old-remote-name] [new-remote-name]</code></li>
<li><code>git remote rm [remote-name]</code></li>
</ul>
</div>
</div>
</div>


<div id="outline-container-orgf324784" class="outline-2">
<h2 id="orgf324784"><span class="section-number-2">3</span> Git Branching</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-org5b30160" class="outline-3">
<h3 id="org5b30160"><span class="section-number-3">3.1</span> Create and switch branch</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li><code>git branch [branch-name]</code></li>
<li><code>git checkout [branch-name]</code>: commit and have a clean branch before
switching or do stashing.</li>
<li><code>git checkout -b [branch-name]</code>: create a branch and switch.</li>
<li><code>git log --oneline --decorate --graph --all</code>: print out the history
of committing and branching.</li>
</ul>
</div>
</div>

<div id="outline-container-orga968f93" class="outline-3">
<h3 id="orga968f93"><span class="section-number-3">3.2</span> Merge</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li><code>git merge [branch-name]</code>.
<ul class="org-ul">
<li>fast-forward merge</li>
<li>recursive merge</li>
</ul></li>
<li><code>git branch -d [branch-name]</code> delete the merged and unused branch.</li>
</ul>
</div>
</div>

<div id="outline-container-orga47b4e7" class="outline-3">
<h3 id="orga47b4e7"><span class="section-number-3">3.3</span> Merge conflicts</h3>
<div class="outline-text-3" id="text-3-3">
<ul class="org-ul">
<li>Merge conflicts happens when two branches have work on the same
lines of a file.</li>
<li>Use <code>git status</code> to check the conflicting file(s).</li>
<li>Modify the conflicts manually.</li>
<li>Or use <code>git mergetool</code></li>
</ul>
</div>
</div>

<div id="outline-container-orge4720b7" class="outline-3">
<h3 id="orge4720b7"><span class="section-number-3">3.4</span> Branch management</h3>
<div class="outline-text-3" id="text-3-4">
<p>
What follows is one typical workflow with branches:
</p>
<ul class="org-ul">
<li>The long-live (master) branch: the most stable branch.
<ul class="org-ul">
<li>The developing branch(es): less stable than master, but use it to
track on-going work in one or more main directions of a project.
<ul class="org-ul">
<li>The topic branch(es): the short-live branches for solving very
specific problems.</li>
</ul></li>
</ul></li>

<li><code>git branch -v</code> see the latest commit in each branch.</li>
<li><code>git branch --merged</code> or <code>git branch --no-merged</code> show branches that
have been merged or haven't.</li>
</ul>
</div>
</div>

<div id="outline-container-org7d8ec60" class="outline-3">
<h3 id="org7d8ec60"><span class="section-number-3">3.5</span> Remote branch</h3>
<div class="outline-text-3" id="text-3-5">
<ul class="org-ul">
<li><code>git ls-remote [remote-name]</code> and <code>git remote show [remote-name]</code>
show the list of remote(s) and other information.</li>
<li><code>git fetch [remote-name] &lt;refs:branches or tags&gt;</code> download the data
from the remote into a local directory
<code>[remote-name]/[branch-name]</code>, but this directory is not
workable. To work on it, do merging, <code>git merge [remote]/[branch]</code>.</li>
<li>Use <code>git checkout -b [local-branch] [remote-name]/[branch-name]</code> to
create a local branch that can be worked on and track the remote
branch.</li>
</ul>
</div>
</div>

<div id="outline-container-orgc649e10" class="outline-3">
<h3 id="orgc649e10"><span class="section-number-3">3.6</span> Pushing</h3>
<div class="outline-text-3" id="text-3-6">
<ul class="org-ul">
<li><code>git push [remote] [branch]</code></li>
<li><code>git push [remote] [branch]:[new-branchname]</code> to give the remote
branch a different name.</li>
<li>If the remote branch does not exits, git suggest using <code>git push -u
  [remote] [branch]</code> or <code>git push --set-upstream [remote]
  [branch]</code>. This action triggers a pull request in github, from which
I can choose to merge the remote branch to the existing remote
master branch.</li>
</ul>
</div>
</div>

<div id="outline-container-orgc4d6836" class="outline-3">
<h3 id="orgc4d6836"><span class="section-number-3">3.7</span> Tracking branch</h3>
<div class="outline-text-3" id="text-3-7">
<ul class="org-ul">
<li>Tracking branches are local branches that track upstream remote
branch.</li>
<li><code>git clone</code> automatically generate a tracking branch <code>origin/master</code></li>
<li>Use <code>git checkout -b [local-branch] [remote]/[branch]</code> to create a
tracking branch for a specific remote branch.</li>
<li><code>git checkout --track [remote]/[branch]</code> is a shorthand for the
command above.</li>
<li><code>git branch -u [remote]/[branch]</code> or <code>git branch --set-upstream-to
  [remote]/[branch]</code> to set up a remote upstream branch. This is
working when the remote upstream branch exists.</li>
<li>If not, use <code>git push -u [remote] [branch]</code> to set up a remote
branch, which is automatically set as the local tracking branch.</li>
<li><code>git branch -vv</code> list local branches with their tracking branches.</li>
</ul>
</div>
</div>

<div id="outline-container-org04fc766" class="outline-3">
<h3 id="org04fc766"><span class="section-number-3">3.8</span> Pulling</h3>
<div class="outline-text-3" id="text-3-8">
<ul class="org-ul">
<li><code>git pull</code> is <code>git fetch</code> + <code>git merge</code>.</li>
<li>Better to use fetch and merge separately to avoid confusing.</li>
</ul>
</div>
</div>

<div id="outline-container-org3971b02" class="outline-3">
<h3 id="org3971b02"><span class="section-number-3">3.9</span> Delete remote branches</h3>
<div class="outline-text-3" id="text-3-9">
<ul class="org-ul">
<li><code>git push [remote] --delete [branch]</code></li>
</ul>
</div>
</div>

<div id="outline-container-org65be637" class="outline-3">
<h3 id="org65be637"><span class="section-number-3">3.10</span> Rebasing</h3>
<div class="outline-text-3" id="text-3-10">
</div><div id="outline-container-org1239fd1" class="outline-4">
<h4 id="org1239fd1">Basic rebase</h4>
<div class="outline-text-4" id="text-org1239fd1">
<p>
A typical workflow: See Figures 3-27 to 3-30
</p>
<ol class="org-ol">
<li><code>git checkout [topicbranch]</code></li>
<li><code>git rebase [basebranch]</code></li>
<li><code>git checkout [basebranch]</code></li>
<li><code>git merge [topicbranch]</code></li>
</ol>
</div>
</div>

<div id="outline-container-org181a23d" class="outline-4">
<h4 id="org181a23d">The perils of rebasing</h4>
<div class="outline-text-4" id="text-org181a23d">
<p>
<b>Do not rebase commits that exist outside your repository.</b>
Excerpt From: Scott Chacon, Ben Straub. “Pro Git.” iBooks.
</p>
</div>
</div>

<div id="outline-container-orgef050be" class="outline-4">
<h4 id="orgef050be">Rebase vs. Merge</h4>
<div class="outline-text-4" id="text-orgef050be">
<p>
Which is better, rebase or merge, depends on how you view the commit
history.
</p>
<dl class="org-dl">
<dt>Review 1</dt><dd>a record of what actually happened. This view value the
intact of the committing history, preferring merging to
rebasing.</dd>
<dt>Review 2</dt><dd>story of how your project was made. Rebasing is like
manipulating history but it is OK according to this
view.</dd>
</dl>
</div>
</div>
</div>
</div>



<div id="outline-container-org411c81f" class="outline-2">
<h2 id="org411c81f"><span class="section-number-2">4</span> <span class="todo TODO">TODO</span> Git server</h2>
</div>

<div id="outline-container-orgdf08e0b" class="outline-2">
<h2 id="orgdf08e0b"><span class="section-number-2">5</span> <span class="todo TODO">TODO</span> Distributed Git</h2>
</div>

<div id="outline-container-orgeff304b" class="outline-2">
<h2 id="orgeff304b"><span class="section-number-2">6</span> <span class="todo TODO">TODO</span> Github</h2>
</div>

<div id="outline-container-org710fc2b" class="outline-2">
<h2 id="org710fc2b"><span class="section-number-2">7</span> <span class="todo TODO">TODO</span> Git tools</h2>
<div class="outline-text-2" id="text-7">
</div><div id="outline-container-orgc4f92a7" class="outline-3">
<h3 id="orgc4f92a7"><span class="section-number-3">7.1</span> <span class="todo TODO">TODO</span> Stashing and cleaning</h3>
</div>
<div id="outline-container-org20cc2e9" class="outline-3">
<h3 id="org20cc2e9"><span class="section-number-3">7.2</span> <span class="todo TODO">TODO</span> Reset demystified</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2017-01-20 Fri 00:00</p>
<p class="author">Author: Zheng Tian</p>
<p class="date">Created: 2017-02-09 Thu 22:27</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
